{
	"courses": [
		{
			"id": 1,
			"Title": "Practical LINQ",
			"Description": "This course covers practical uses of Language Integrated Query (LINQ). With LINQ, you can search, sort, create, compare and analyze your data. And you can use LINQ to manipulate and shape your data for display in a user interface. With its common syntax, strong typing, Intellisense support, and transformational features, like the internet, you will wonder how you ever coded without it. Enjoy!",
			"Duration": 212,
			"Creationdate": "2018-06-30T22:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 2,
			"Title": "Using GitFlow",
			"Description": "GitFlow is a set of rules that gives users of Git a set of best practices to use when using Git. The set rules govern how to setup Git branches, which branches to have, when to create feature branches, when and what to tag, and when to merge and to which branch. The idea being that with a set of rules to follow using any source control system becomes easier. GitFlow does not add anything new to established workflows such as the feature branch workflow. What it does, though, is to give specific roles to different branches and defines how and when they should interact. The workflow uses feature branches as well as individual branches for preparing, maintaining, and recording releases. You also get the benefits of the feature branch workflow such as pull requests and more efficient collaboration.",
			"Duration": 64,
			"Creationdate": "2018-07-29T22:00:00.000Z",
			"IsTopRated": false
		},
		{

			"id": 3,
			"Title": "ASP.NET Core Tag Helpers",
			"Description": "Tag Helpers are one of the new technologies in ASP.NET Core that making building web pages (Razor view pages) much easier and more intuitive for both designers and developers. In this course, ASP.NET Core Tag Helpers, you will learn the fundamentals of Tag Helpers. First, you will explore how to effectively use the 17 Tag Helpers built into ASP.NET Core on your Razor view pages to build forms. Next, you will explore cache images. Finally, you will customize anchor tags and build a JavaScript manager that takes advantage of many Tag Helper and ASP.NET Core features. By the end of the course, youXC60ll be able to efficiently author both simple and advanced Tag Helpers.",
			"Duration": 168,
			"Creationdate": "2017-02-19T23:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 4,
			"Title": "Accelerated C# Fundamentals",
			"Description": "Formerly titled \"C# Fundamentals - Part 1,\" this course is designed to give C++ and Java developers an accelerated introduction to C# on the .NET platform. For a beginner-level introduction to C#, refer to \"C# Fundamentals with C# 5.0.",
			"Duration": 377,
			"Creationdate": "2010-04-25T22:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 5,
			"Title": "Angular: Getting Started",
			"Description": "Angular is one of the fastest, most popular open source web app frameworks today, and knowing how to use it is essential for developers. You will learn how to create components and user interfaces, data-binding, retrieving data using HTTP, and more.",
			"Duration": 340,
			"Creationdate": "2018-08-10T22:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 6,
			"Title": "Getting Started with Building Bots with Microsoft's Bot Framework",
			"Description": "This course is an introduction to the Microsoft Bot Framework - a new centralized framework that allows you to create, edit and deploy Chatbots quickly and easily.",
			"Duration": 149,
			"Creationdate": "2018-08-10T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 7,
			"Title": "Angular Fundamentals",
			"Description": "This course will teach you the fundamentals of working with the latest version of Angular. You will learn everything you need to know to create complete applications including: components, services, directives, pipes, routing, HTTP, and even testing.",
			"Duration": 575,
			"Creationdate": "2018-08-02T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 8,
			"Title": "Become a Full-stack .NET Developer",
			"Description": "Have you always wanted to see how professional, experienced developers build an application from A to Z? This course will show you how. You'll build a real-world mini social networking application with ASP.NET MVC 5 and Entity Framework 6.",
			"Duration": 334,
			"Creationdate": "2016-04-24T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 9,
			"Title": "Python Fundamentals",
			"Description": "Python Fundamentals gets you started with Python, a dynamic language popular for web development, big data, science, and scripting.",
			"Duration": 311,
			"Creationdate": "2017-10-25T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 10,
			"Title": "Docker for Web Developers",
			"Description": "Docker can bring many benefits to your development workflow and deployment process. You'll learn how to use Docker tools and commands, how to work with images and containers, container orchestration techniques, and much more.",
			"Duration": 341,
			"Creationdate": "2018-08-19T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 11,
			"Title": "Building a JavaScript Development Environment",
			"Description": "Starting a new JavaScript project from scratch is overwhelming. This course provides a playbook outlining the key decisions you need to make. Build a robust development environment that handles bundling, linting, transpiling, testing, and much more.",
			"Duration": 319,
			"Creationdate": "2016-11-09T23:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 12,
			"Title": "Understanding Machine Learning",
			"Description": "Need a short, clear introduction to machine learning? Watch this.",
			"Duration": 39,
			"Creationdate": "2016-03-03T23:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 13,
			"Title": "Domain-Driven Design Fundamentals",
			"Description": "This course teaches the fundamentals of Domain-Driven Design (DDD) through a demonstration of customer interactions and a complex demo application, along with advice from Eric Evans.",
			"Duration": 256,
			"Creationdate": "2014-07-24T22:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 14,
			"Title": "Building Your First API with ASP.NET Core",
			"Description": "Microsoft is moving towards a new direction with its developer frameworks, signified by the cross-platform, modular, and faster ASP.NET Core 1.x/2.0 and Entity Framework Core 1.x/2.0. In this course, you'll learn how to build an API with these.",
			"Duration": 261,
			"Creationdate": "2017-09-10T22:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 15,
			"Title": "Building Mobile Apps with Ionic, Angular, and TypeScript",
			"Description": "This code-focused course explores the exciting new Ionic framework and shows how to build mobile apps using Angular and TypeScript.",
			"Duration": 247,
			"Creationdate": "2016-11-12T23:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 16,
			"Title": "AngularJS: Get Started",
			"Description": "This course demonstrates how to use the essential abstractions of AngularJS, including modules, controllers, directives, and services.",
			"Duration": 178,
			"Creationdate": "2014-08-05T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 16,
			"Title": "React.js: Getting Started",
			"Description": "Learn the basics of React.js, and build an in-browser, math skills kids' game from scratch with it.",
			"Duration": 103,
			"Creationdate": "2017-05-11T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 17,
			"Title": "Spring Security Fundamentals",
			"Description": "A course covering the fundamentals of using Spring Security for securing Java applications built with Spring MVC.",
			"Duration": 248,
			"Creationdate": "2014-05-02T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 18,
			"Title": "Building Applications with ASP.NET MVC 4",
			"Description": "This course is a comprehensive introduction to ASP.NET MVC 4, and will give you the essentials you need to start building applications with Microsoft's MVC framework.",
			"Duration": 443,
			"Creationdate": "2012-11-07T23:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 19,
			"Title": "Understanding Machine Learning with Python",
			"Description": "Use your data to predict future events with the help of machine learning. This course will walk you through creating a machine learning prediction solution and will introduce Python, the scikit-learn library, and the Jupyter Notebook environment.",
			"Duration": 114,
			"Creationdate": "2016-04-16T22:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 20,
			"Title": "Advanced Node.js",
			"Description": "This course will teach you the core Node.js concepts and API modules from simple utility modules all the way to streams and clusters.",
			"Duration": 225,
			"Creationdate": "2017-03-15T23:00:00.000Z",
			"IsTopRated": false
		},
		{
			"id": 21,
			"Title": "ASP.NET Core Fundamentals",
			"Description": "This course will cover the fundamentals of what you need to know to start building your first ASP.NET Core application with the MVC framework.",
			"Duration": 349,
			"Creationdate": "2017-12-08T23:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 22,
			"Title": "What Every Developer Must Know About HTTPS",
			"Description": "HTTPS is an essential component of any software running on the web. This course teaches developers how to get their apps talking securely over the web, while avoiding the common pitfalls so many sites fall victim to.",
			"Duration": 304,
			"Creationdate": "2017-05-11T22:00:00.000Z",
			"IsTopRated": true
		},
		{
			"id": 22,
			"Title": "Clean Architecture: Patterns, Practices, and Principles",
			"Description": "In this course, you will learn about Clean Architecture, a set of modern patterns, practices, and principles for creating software architecture that is simple, understandable, flexible, testable, and maintainable.",
			"Duration": 141,
			"Creationdate": "2017-02-10T23:00:00.000Z",
			"IsTopRated": true
		}
  ]
}